// 자바스크립트 시작합니다.
//  html = 뼈대 , css 로 거죽을 입히고, Js가 근육이다.

// 브라우저가 다양하게 등장하면서
// JS 표준이 등장하기 전에는
// 자바스크립트 동작방식이 다 달랐던 과거.
// 지금은 표준이 생겨 , 정말 소금과 같은 존재가 되었다!

// * 자바스크립트는 대소문자 구분이 있어야한다!!!!!
// * 세미콜론 (;) 을 붙여줘야 한다. 끝났다는 선언이다.
// * 값과 리터럴 -
// ** 숫자 ( Number ) 로 부르며, 정수 : -999,0,999 / 소수 : 1.3 으로 이루어진다.
// *** 자바스크립트는 계산을 잘 못해, 정확한 계산보다 빠른 계산을 선호해
// ** 문자 ( String ) :  총 세가지로 쓰인다.

const singleQuote = "반";
const doubleQuote = "반";
const 템플릿리터럴 = `반`; // 옵션이랑 백 팁 -> 이렇게 생긴거

// * Boolean , true // false - 조건부렌더링
// * null : 변수는 있으나 값이 비어있는 상태.
//  ** object - 심오하다. 객체인데 다음으로 넘긴다.
// *undefined : 정의도 안되어있다. 존재도 없다.

//  표현식

// **변수 - 값을 담는 컨테이너다, 다양한 값을 담을 수 있다.
// *** repl.it -> 자바계의코드펜
//  *** 선언과 할당에 대한 이해를 해야한다.
// *** 반복문과 제어문

// 다음주에는 MAP을 할 거에요.
